app/controllers/sessions_controller.rb

  def create
    user = User.where(email: params[:email], password: params[:password])
    if user.count>0
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'asdfgh@sdfgh.fg' AND `users`.`password` = 'qwerty' ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `users` WHERE `users`.`email` = 'qwerty@qwe.dfg' AND `users`.`password` = 'qwercty'