app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @items = render json: User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def show
    @items = render json: User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password`) VALUES ('atul', 'qwerty@qwe.dfg', '2019-12-12 09:23:17.778803', '2019-12-12 09:23:17.778803', 'testtest')
---
  def create
    user = User.new
    user.name = params[:name]
    user.email = params[:email]
    user.password = params[:password]
    user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1
UPDATE `users` SET `users`.`password` = 'qwercty', `users`.`updated_at` = '2019-12-12 10:28:09.858255' WHERE `users`.`id` = 2
---
  def update
    user = User.find(params[:id])
    user.password = params[:password] if params.key?(:password)
    user.name = params[:name] if params.key?(:name)
    user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    user = User.find(params[:id])
    user.destroy